/*
 * itemdb.cpp
 * 
 * ShowEQ Distributed under GPL
 * http://seq.sourceforge.net/
 *
 *  Copyright 2003-2007 by the respective ShowEQ Developers
 */

static char* itemdbid = "@(#) $Id: itemdb.cpp 664 2007-02-03 03:47:08Z dohpaz $ $Name$";

#include <unistd.h>
#include <stdio.h>

#include <QFileInfo>
#include <QString>

#include "itemdb.h"
#include "util.h"
#include "datalocationmgr.h"

#ifdef USE_DB3
#include "gdbmconv.h"
#endif

#define UPGRADE_STATUS_UPDATE 100

// define the current version number for data in database
#define CURRENT_ITEM_FORMAT_VERSION 2

// forward declarations
QString& getField(QString& field, const char*& curPos);
QString& getLastField(QString& field, const char*& curPos);

// Base Item Database Entry structure from which all EQItemDBEntryData
// structures inherit for identity reasons
struct EQItemDBEntryData
{
	uint16_t m_entryFormatVersion;   // Specifies version of entry data format
	size_t m_entrySize;            // size of the whole database entry in bytes
};

struct EQItemDBEntryData_1 : public EQItemDBEntryData
{
public:
	// public constructors (mostly for convenience)
	EQItemDBEntryData_1();
	EQItemDBEntryData_1(const EQItemDBEntryData &);

	// public member functions

	// initialize the DBEntryData using Datum from a database
	void Init(const Datum& data);

	// initialize the DBEntryData with empty/default values
	void Init();

	// public data members
	char   m_idfile[6];             // Not sure what this is used for, eg: IT63
	int16_t   m_flag;               // See itemStruct for values
	uint8_t  m_weight;              // Weight of item
	int8_t   m_nosave;              // Nosave flag 1=normal, 0=nosave, -1=spell?
	int8_t   m_nodrop;              // Nodrop flag 1=normal, 0=nodrop, -1=??
	uint8_t  m_size;                // Size of item
	uint16_t  m_iconNr;             // Icon Number
	uint32_t m_equipableSlots;      // Slots where this item goes
	int32_t  m_cost;                // Item cost in copper
	int8_t   m_STR;                 // Strength
	int8_t   m_STA;                 // Stamina
	int8_t   m_CHA;                 // Charisma
	int8_t   m_DEX;                 // Dexterity
	int8_t   m_INT;                 // Intelligence
	int8_t   m_AGI;                 // Agility
	int8_t   m_WIS;                 // Wisdom
	int8_t   m_MR;                  // Magic Resistance
	int8_t   m_FR;                  // Fire Resistance
	int8_t   m_CR;                  // Cold Resistance
	int8_t   m_DR;                  // Disease Resistance
	int8_t   m_PR;                  // Poison Resistance
	int8_t   m_HP;                  // Hitpoints
	int8_t   m_MANA;                // Mana
	int8_t   m_AC;                  // Armor Class
	uint8_t  m_light;               // Light effect of this item
	int8_t   m_delay;               // Weapon Delay
	int8_t   m_damage;              // Weapon Damage
	uint8_t  m_range;               // Range of weapon
	uint8_t  m_skill;               // Skill of this weapon
	int8_t   m_magic;               // Magic flag, 1(0001)=magic
	int8_t   m_level0;              // Casting level
	uint8_t  m_material;            // Material?
	uint32_t m_color;               // Amounts of RGB in original color
	uint16_t  m_spellId0;           // SpellID of special effect
	uint16_t  m_classes;            // Classes that can use this item
	uint16_t  m_races;              // Races that can use this item
	uint8_t  m_level;               // Casting level
	uint16_t  m_spellId;            // spellId of special effect
	int8_t   m_charges;             // number of charges of item effect (-1 = inf)
	uint8_t  m_numSlots;            // number of slots
	uint8_t  m_weightReduction;     // percentage weight reduction
	uint8_t  m_sizeCapacity;        // Maximum size item container can hold
};

struct EQItemDBEntryData_2 : public EQItemDBEntryData_1
{
public:
	// public constructors (mostly for convenience)
	EQItemDBEntryData_2();
	EQItemDBEntryData_2(const EQItemDBEntryData &);

	// public member functions

	// initialize the DBEntryData using Datum from a database
	void Init(const Datum& data);

	// initialize the DBEntryData with empty/default values
	void Init();

	// public data members
	int8_t m_stackable;             // 1=stackable, 3=normal, 0=?
	int8_t m_effectType;            // 0=no, 1=click anywhere w/o class check,
	// 2=latent, 3=click anywhere EXPENDABLE,
	// 4=click worn, 5=click anywhere with
	// class check
	uint32_t m_castTime;            // cast time of effect
	uint16_t m_skillModId;          // ID of skill that item modifies
	int8_t m_skillModPercent;       // Percent that item modifies the skill
};

struct EQItemDBEntryData_3 : public EQItemDBEntryData
{
public:
	// public member functions
	// initialize the DBEntryData using the serialized item info
	const char* Init(const char* serializedItem, ItemType itemType);

	// initialize the DBEntryData using Datum from a database
	void Init(const Datum& data);

	// initialize the DBEntryData with empty/default values
	void Init();

	// book keeping member to keep track of the last time this was updated
	time_t m_updated;

	// public data members - fields numbered by where they occur in the
	//  '|' delimited data
	/*005*/ ItemType m_itemType;            // item type
	/*006*/ // name - stored after the structure
	/*007*/ // lore name - stored after name after the structure
	/*008*/ char     m_idfile[6];           // Not sure what this is used for, eg: IT63
	/*009*/ uint32_t m_itemNr;
	/*010*/ uint8_t  m_weight;              // Weight of item
	/*011*/ int8_t   m_norent;              // Norent flag 1=normal, 0=no rent, -1=spell?
	/*012*/ int8_t   m_nodrop;              // Nodrop flag 1=normal, 0=nodrop, -1=??
	/*013*/ uint8_t  m_size;                // Size of item
	/*014*/ uint32_t m_equipableSlots;      // Slots where this item goes
	/*015*/ int32_t  m_cost;                // Item cost in copper
	/*016*/ uint16_t  m_iconNr;             // Icon Number
	/*017*/ int32_t  m_unknown018;
	/*018*/ uint32_t m_unknown019;
	/*019*/ uint32_t m_unknown020;
	/*020*/ bool     m_tradeskills;         // Tradeskill item?
	/*021*/ int8_t   m_CR;                  // Cold Resistance
	/*022*/ int8_t   m_DR;                  // Disease Resistance
	/*023*/ int8_t   m_PR;                  // Poison Resistance
	/*024*/ int8_t   m_MR;                  // Magic Resistance
	/*025*/ int8_t   m_FR;                  // Fire Resistance
	/*026*/ int8_t   m_STR;                 // Strength
	/*027*/ int8_t   m_STA;                 // Stamina
	/*028*/ int8_t   m_AGI;                 // Agility
	/*029*/ int8_t   m_DEX;                 // Dexterity
	/*030*/ int8_t   m_CHA;                 // Charisma
	/*031*/ int8_t   m_INT;                 // Intelligence
	/*032*/ int8_t   m_WIS;                 // Wisdom
	/*033*/ int8_t   m_HP;                  // Hitpoints
	/*034*/ int8_t   m_MANA;                // Mana
	/*035*/ int8_t   m_AC;                  // Armor Class
	/*036*/ uint32_t m_deity;
	/*037*/ uint16_t m_skillModId;          // ID of skill that item modifies
	/*038*/ int8_t   m_skillModPercent;     // Percent that item modifies the skill
	/*039*/ int32_t  m_baneDmg;             // Bane Damage
	/*040*/ uint32_t m_baneDmgRace;         // Bane Damage Race
	/*041*/ uint32_t m_baneDmgBody;         // Bane Damage Body 1=Humanoid,2=Lycanthrope,
	// 3=Undead,4=Giant,5=Construct,6=Extraplanar,
	// 7=Magical
	/*042*/ int8_t   m_magic;               // Magic flag, 1(0001)=magic
	/*043*/ int32_t  m_castTime;
	/*043*/ union 
	{
		/*044*/ uint8_t  m_level;            // Casting level
		/*044*/ uint8_t  m_haste;             // Haste % 
	};
	/*045*/ uint8_t  m_requiredLevel;       // Required Level to use item
	/*046*/ uint32_t m_bardSkillType;       // Bard Skill Type
	/*047*/ int32_t  m_bardSkillAmount;     // Bard Skill Amount
	/*048*/ uint8_t  m_light;               // Light effect of this item
	/*049*/ int8_t   m_delay;               // Weapon Delay
	/*050*/ uint8_t  m_recommendedLevel;    // Recommended level to use item
	/*051*/ uint8_t  m_recommendedSkill;    // Recommended skill to use item (primary skill)
	/*052*/ uint8_t  m_elemDmgType;         // Elemental Damage Type (1=magic, 2=fire)
	/*053*/ uint8_t  m_elemDmg;             // Elemental Damage
	/*054*/ int8_t m_effectType;            // 0=no, 1=click anywhere w/o class check,
	// 2=latent, 3=click anywhere EXPENDABLE,
	// 4=click worn, 5=click anywhere with
	// class check
	/*055*/ uint8_t  m_range;               // Range of weapon
	/*056*/ int8_t   m_damage;              // Weapon Damage
	/*057*/ uint32_t m_color;               // Amounts of RGB in original color
	/*058*/ uint32_t  m_classes;            // Classes that can use this item
	/*059*/ uint32_t  m_races;              // Races that can use this item
	/*060*/ uint32_t m_unknown061;
	/*061*/ uint16_t  m_spellId;            // SpellID of special effect
	/*062*/ int8_t   m_charges;             // number of charges of item effect (-1 = inf)
	/*063*/ uint8_t  m_skill;               // Skill of this weapon
	/*064*/ uint8_t  m_material;            // Material?
	/*065*/ int32_t  m_sellRate;            // Item sell rate
	/*066*/ uint32_t m_unknown067;
	/*067*/ union 
	{
		/*067*/ uint32_t m_fullfillment;      // Food fulfilment (How long it lasts)
		/*067*/ int16_t  m_clickyCastTime;    // Cast Time for clicky effects, in milliseconds
	};
	/*068*/ uint32_t m_unknown069;
	/*069*/ uint32_t m_unknown070;
	/*070*/ int32_t  m_focusId;		// Focus Effect Id
	/*071*/ int8_t   m_combatEffects;	// PoP: Combat Effects +
	/*072*/ int8_t   m_shielding;		// PoP: Shielding %
	/*073*/ int8_t   m_stunResist;	// PoP: Stun Resist %
	/*074*/ int8_t   m_strikeThrough;	// PoP: Strike Through %
	/*075*/ uint32_t m_unknown076;
	/*076*/ uint32_t m_unknown077;
	/*077*/ int8_t   m_spellShield;	// PoP: Spell Shield %
	/*078*/ int8_t   m_avoidance;		// PoP: Avoidance +
	/*079*/ int8_t   m_accuracy;		// PoP: Accuracy +
	/*080*/ uint32_t m_unknown081;
	/*081*/ int32_t  m_factionMod1;	// Faction Mod 1
	/*082*/ int32_t  m_factionMod2;	// Faction Mod 2
	/*083*/ int32_t  m_factionMod3;	// Faction Mod 3
	/*084*/ int32_t  m_factionMod4;	// Faction Mod 4
	/*085*/ int32_t  m_factionAmt1;	// Faction Amt 1
	/*086*/ int32_t  m_factionAmt2;	// Faction Amt 2
	/*087*/ int32_t  m_factionAmt3;	// Faction Amt 3
	/*088*/ int32_t  m_factionAmt4;	// Faction Amt 4
	/*089*/ char	   m_charmFile[32];	// file name of the charm
	/*090*/ uint32_t m_unknown091;
	/*091*/ uint8_t  m_augSlot1Type;	// LDoN: Augment Slot 1 Type
	/*092*/ uint8_t  m_augSlot2Type;	// LDoN: Augment Slot 2 Type
	/*093*/ uint8_t  m_augSlot3Type;	// LDoN: Augment Slot 3 Type
	/*094*/ uint8_t  m_augSlot4Type;	// LDoN: Augment Slot 4 Type
	/*095*/ uint8_t  m_augSlot5Type;	// LDoN: Augment Slot 5 Type
	/*096*/ uint32_t m_ldonTheme;
	/*097*/ uint32_t m_ldonPrice;
	/*098*/ uint32_t m_ldonSold;
	/*099*/ uint8_t  m_packType;		// 0:Small Bag, 1:Large Bag, 2:Quiver, 3:Belt Pouch ... there are 50 types
	/*100*/ uint8_t  m_numSlots;          // number of slots
	/*101*/ uint8_t  m_weightReduction;   // percentage weight reduction
	/*102*/ uint8_t  m_sizeCapacity;      // Maximum size item container can hold
	/*103*/ uint8_t  m_bookType;		// 0=rolled up note, 1=book
	/*104*/ uint32_t m_unknown105;
	/*105*/ char	   m_bookFile[16];	// file name of the book
	/*106*/ uint32_t m_unknown107;
	/*107*/ uint32_t m_unknown108;
};

struct EQItemDBEntryData_4 : public EQItemDBEntryData_3
{
public:
	// public member functions
	// initialize the DBEntryData using the serialized item info
	const char* Init(const char* serializedItem, ItemType itemType);

	// initialize the DBEntryData using Datum from a database
	void Init(const Datum& data);

	// initialize the DBEntryData with empty/default values
	void Init();

	uint8_t m_loreFlag;
	uint8_t m_pendingLoreFlag;
	uint8_t m_artifactFlag;
	uint8_t m_summonedFlag;
};

typedef EQItemDBEntryData_4 EQItemDBEntryData_Current;

////////////////////////////////////////////////////////////////////
// Life is easier if new versions can inherit from the immediate
// predecessor version.  Otherwise more work and is necessary in 
// the EQItemDBEntry class accessor methods and in the 
// EQItemDBEntryData child classes.  Therefore next one should be:
//  
// struct EQItemDBEntryData_5 : public EQItemDBEntryData_4
//

