/*
 * player.cpp
 *
 *  ShowEQ Distributed under GPL
 *  http://seq.sourceforge.net/
 *
 *  Copyright 2000-2007 by the respective ShowEQ Developers
 */

#include "player.h"
#include "util.h"
#include "packetcommon.h"
#include "diagnosticmessages.h"
#include "guild.h"
#include "zonemgr.h"
#include "main.h"

#include <stdio.h>
#include <unistd.h>

#include <qdir.h>
#include <qfile.h>
#include <qdatastream.h>

using namespace Qt;
// #define DEBUG_PLAYER

//----------------------------------------------------------------------
// constants
static const char magicStr[5] = "plr2"; // magic is the size of uint32_t + a null
static const uint32_t* magic = (uint32_t*)magicStr;

static const char* conColorBasePrefNames[] =
{
  "GrayBase",
  "GreenBase",
  "CyanBase",
  "BlueBase",
  "Even",
  "YellowBase",
  "RedBase",
  "Unknown"
};


Player::Player (QObject* parent,
		ZoneMgr* zoneMgr,
		GuildMgr* guildMgr,
		const char* name)
  : QObject(parent, name),
    Spawn(),
    m_zoneMgr(zoneMgr),
    m_guildMgr(guildMgr)
{
#ifdef DEBUG_PLAYER
  debug("Player()");
#endif

  connect(m_zoneMgr, SIGNAL(zoneChanged(const QString&)),
          this, SLOT(zoneChanged()));
  
  m_NPC = SPAWN_SELF;

  QString section = "Defaults";
  m_useAutoDetectedSettings = 
    pSEQPrefs->getPrefBool("useAutoDetectedSettings", section, true);
  m_defaultName = pSEQPrefs->getPrefString("DefaultName", section, "You");
  m_defaultLastName = pSEQPrefs->getPrefString("DefaultLastName", section, "");

                     m_lastSpawnKilledLevel,
                     expIncrement,
                     m_zoneMgr->longZoneName());
      
     // have gained experience for the kill, it's no longer fresh
     m_freshKill = false;
  }
  else
     emit expGained( "Unknown", // Randomly blessed with xp?
                     0, // don't know what gave it so, level 0
		     expIncrement,
		     m_zoneMgr->longZoneName());

  emit expChangedInt( m_currentExp, m_minExp, m_maxExp);

  // update the con table
  fillConTable();

  if (showeq_params->savePlayerState)
    savePlayerState();

  updateLastChanged();

  // signal that the level changed
  emit levelChanged(m_level);
  emit changeItem(this, tSpawnChangedLevel);
}

void Player::updateNpcHP(const uint8_t* data)
{
  const hpNpcUpdateStruct* hpupdate = (const hpNpcUpdateStruct*)data;

  if (hpupdate->spawnId != id())
    return;

  m_curHP = hpupdate->curHP;
  m_maxHP = hpupdate->maxHP;

  m_validHP = true;

  updateLastChanged();

  emit changeItem(this, tSpawnChangedHP);

  emit hpChanged(m_curHP, m_maxHP);

  if (showeq_params->savePlayerState)
    savePlayerState();
}

void Player::updateSpawnInfo(const uint8_t* data)
{
  const SpawnUpdateStruct *su = (const SpawnUpdateStruct *)data;
  if (su->spawnId != id())
    return;

  if (su->subcommand != 17)
    return;

  m_curHP = su->arg1;

  m_validHP = true;

  updateLastChanged();

  emit changeItem(this, tSpawnChangedHP);

  emit hpChanged(m_curHP, m_maxHP);

  if (showeq_params->savePlayerState)
    savePlayerState();
}

void Player::updateStamina(const uint8_t* data)
{
  const staminaStruct *stam = (const staminaStruct *)data;
  m_food = stam->food;
  m_water = stam->water;
  m_validStam = true;

  emit stamChanged(m_food, 127, m_water, 127);

  if (showeq_params->savePlayerState)
    savePlayerState();
}

void Player::setLastKill(const QString& name, uint8_t level)
{
  // note the last spawn this player killed
  m_lastSpawnKilledName = name;
  m_lastSpawnKilledLevel = level;
  m_freshKill = true;
}

void Player::zoneChanged()
{
  reset();
  clear();
}

void Player::playerUpdateSelf(const uint8_t* data, size_t, uint8_t dir)
{
  const playerSelfPosStruct *pupdate = (const playerSelfPosStruct*)data;

  if ((dir != DIR_Client) && (pupdate->spawnId != id()))
    return;
  else if (dir == DIR_Client)
    setPlayerID(pupdate->spawnId);

  int16_t py = int16_t(pupdate->y);
  int16_t px = int16_t(pupdate->x);
  int16_t pz = int16_t(pupdate->z);
  int16_t pdeltaX = int16_t(pupdate->deltaX);
  int16_t pdeltaY = int16_t(pupdate->deltaY);
  int16_t pdeltaZ = int16_t(pupdate->deltaZ);

#if 0 
  // Dump position updates for debugging client update changes
  for (int i=0; i<sizeof(playerSelfPosStruct); i++)
  {
      printf("%.2x", data[i]);

      if ((i+1) % 8 == 0)
      {
          printf("    ");
      }
      else
      {
          printf(" ");
      }

  }
  printf("\n");
#endif

#if 0
    // Debug positioning without having to recompile everything...
#pragma pack(1)
struct pos
{
/*0000*/ uint16_t spawnId;        // Player's spawn id
/*0002*/ uint8_t unknown0002[2];  // ***Placeholder (update time counter?)
/*0004*/ uint8_t unknown0004[4];  // ***Placeholder
/*0008*/ float x;                 // x coord (2nd loc value)
/*0012*/ float y;                 // y coord (1st loc value)
/*0016*/ signed deltaHeading:10;  // change in heading
         unsigned animation:10;   // animation
         unsigned padding0016:12; // ***Placeholder 
/*0020*/ float deltaX;            // Change in x
/*0024*/ float deltaY;            // Change in y
/*0028*/ float z;                 // z coord (3rd loc value)
/*0032*/ float deltaZ;            // Change in z
/*0036*/ unsigned padding0036:10; // animation
         unsigned heading:12;     // Directional heading
         unsigned padding0037:10; // ***Placeholder 
/*0040*/
};
#pragma pack(0)
    struct pos *p = (struct pos *)data;
    printf("[%.2x](%f, %f, %f), dx %f dy %f dz %f head %f dhead %f anim %d (%x, %x, %x, %x)\n",
            p->spawnId, p->x, p->y, p->z, 
            p->deltaX, p->deltaY, p->deltaZ, 
            float(p->heading), float(p->deltaHeading),
            p->animation, *(uint16_t*) p->unknown0002, p->padding0016, 
            p->padding0028,
            *(uint32_t*) p->unknown0004);
#endif

  setPos(px, py, pz, showeq_params->walkpathrecord, showeq_params->walkpathlength);
  setDeltas(pdeltaX, pdeltaY, pdeltaZ);
  setHeading(pupdate->heading, pupdate->deltaHeading);
  m_validPos = true;
  updateLast();

  m_headingDegrees = 360 - ((pupdate->heading * 360) >> 11);
  emit headingChanged(m_headingDegrees);

  emit posChanged(x(), y(), z(), 
